

<center>
    <b>
<span style="font-size: 32pt; line-height:1.2"> 
COMS W4111-002 (Spring 2022)<br>Makeup Lecture: <br>Functions, Procedures, Triggers
</span>
        </b>
    </center>
<br>
<br>
<br>

# Setup

In [1]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [5]:
from sqlalchemy import create_engine

In [6]:
sqla_engine = create_engine("mysql+pymysql://root:dbuserdbuser@localhost")

In [8]:
import pymysql

pymysql_conn = pymysql.connect(
    user="root",
    password="dbuserdbuser",
    host="localhost",
    port=3306,
    cursorclass=pymysql.cursors.DictCursor,
    autocommit=True)

In [10]:
import pandas as pd

# Function Example

In [11]:
# Load some sample test data procedured by Mockaroo.
# DFF just uses this tool sometime.
# https://www.mockaroo.com/
#
student_df = pd.read_csv("./students.csv")
student_df

   first_name  last_name middle_name                          email
0     Crissie       Toms      Female            ctoms0@linkedin.com
1      Eartha     Mordon      Female        emordon1@wikispaces.com
2        Kerk   Deverale        Male               kdeverale2@ow.ly
3       Yurik  MacMeanma        Male  ymacmeanma3@elegantthemes.com
4       Kirby      Kubek      Female              kkubek4@issuu.com
..        ...        ...         ...                            ...
95      Taite    Jarrelt        Male           tjarrelt2n@salon.com
96       Lina    Tindall      Female        ltindall2o@sakura.ne.jp
97      Lotte    Smerdon      Female            lsmerdon2p@uiuc.edu
98       Evvy       Ofer      Female    eofer2q@merriam-webster.com
99  Marchelle     Merida      Female      mmerida2r@dagondesign.com

[100 rows x 4 columns]

- Create the table.

In [64]:
%%sql

use f22_db;

drop table if exists f22_db.students;

create table if not exists f22_DB.students
(
    uni         varchar(12)  not null
        primary key,
    first_name  varchar(128) not null,
    middle_name varchar(128) null,
    last_name   varchar(128) not null,
    email       varchar(256) null,
    constraint email
        unique (email)
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [66]:
%%sql

use f22_db;
drop function if exists compute_student_uni;


CREATE FUNCTION compute_student_uni(
    last_name varchar(128),
    first_name varchar(128)
)
RETURNS varchar(12)
DETERMINISTIC
BEGIN
 -- statements
    
    return "Not Computed";
END;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [67]:
%sql select compute_student_uni("Ferguson", "Donald") as next_uni

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('Not Computed',)]

- Let's reset and start again, but with code this time.


- But first add some dummy data.

In [68]:
%%sql

delete from f22_db.students;

insert into f22_DB.students (uni, last_name, first_name, middle_name, email)
values
    ("dff1", "Ferguson", "Donald", "Francis", "dff@cs.columbia.edu"),
    ("rf1", "Ferguson", "Robert", NULL, NULL),
    ("rf2", "Ferguson", "Roger", NULL, NULL)
;

 * mysql+pymysql://root:***@localhost
0 rows affected.
3 rows affected.

[]

In [69]:
%sql select * from f22_db.students;

 * mysql+pymysql://root:***@localhost
3 rows affected.

[('dff1', 'Donald', 'Francis', 'Ferguson', 'dff@cs.columbia.edu'),
 ('rf1', 'Robert', None, 'Ferguson', None),
 ('rf2', 'Roger', None, 'Ferguson', None)]

In [70]:
%%sql

select count(*) + 1 as next_suffix
from
    f22_db.students
where
    uni like
        concat(
            substring("Robert", 1, 1),
            substring("Ferguson", 1, 1),
            "%"
        );

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(3,)]

In [71]:
%%sql

select count(*) + 1 as next_suffix
from
    f22_db.students
where
    uni like
        concat(
            substring("Donald", 1, 1),
            substring("Francis", 1, 1),
            substring("Ferguson", 1, 1),
            "%"
        );

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(2,)]

In [72]:
%%sql


use f22_db;
drop function if exists compute_student_uni;


CREATE FUNCTION compute_student_uni(
    first_name varchar(128),
    middle_name varchar(128),
    last_name varchar(128)
)
RETURNS varchar(12)
DETERMINISTIC
BEGIN

    declare result varchar(12);
    declare prefix varchar(3);
    declare suffix int;
    declare template varchar(4);

    set result = NULL;
    set prefix = NULL;
    set suffix = NULL;

    if middle_name is not NULL then
        set prefix = concat(
                substring(first_name, 1, 1),
                substring(middle_name, 1, 1),
                substring(last_name, 1, 1)
            );
    else
        set prefix = concat(
                substring(first_name, 1, 1),
                substring(last_name, 1, 1)
            );
    end if;

    set template = concat(prefix, "%");

    set suffix = (select count(*)+1 from students where uni like template);

    set prefix = lower(prefix);

    set result = concat(prefix, suffix);

    return result;

END;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [73]:
%sql select compute_student_uni("Douglas", "Felix", "Ferguson");

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('dff2',)]

In [74]:
%sql select compute_student_uni("Ronald", NULL, "Ferguson");

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('rf3',)]

In [75]:
%%sql

set @next_uni = compute_student_uni("Douglas", "Felix", "Ferguson");

insert into f22_db.students values(
    @next_uni,
    "Donald",
    "Felix",
    "Ferguson",
    NULL
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
1 rows affected.

[]

In [62]:
%%sql select * from students;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('dff1', 'Ferguson', 'Francis', 'Donald', 'dff@cs.columbia.edu'),
 ('dff2', 'Donald', 'Felix', 'Ferguson', None),
 ('rf1', 'Ferguson', None, 'Robert', None),
 ('rf2', 'Ferguson', None, 'Roger', None)]

In [76]:
%%sql

set @next_uni = compute_student_uni("Ronald", NULL, "Ferguson");

insert into f22_db.students values(
    @next_uni,
    "Ronald",
    NULL,
    "Ferguson",
    NULL
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
1 rows affected.

[]

In [78]:
%%sql

select * from students;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('dff1', 'Donald', 'Francis', 'Ferguson', 'dff@cs.columbia.edu'),
 ('dff2', 'Donald', 'Felix', 'Ferguson', None),
 ('rf1', 'Robert', None, 'Ferguson', None),
 ('rf2', 'Roger', None, 'Ferguson', None),
 ('rf3', 'Ronald', None, 'Ferguson', None)]

# Procedure Example

In [86]:
%%sql

drop procedure if exists create_student;

CREATE PROCEDURE create_student(
    in first_name varchar(128),
    in middle_name varchar(128),
    in last_name varchar(128),
    in email varchar(256),
    out new_uni varchar(12)
)
BEGIN

    set new_uni = compute_student_uni(first_name, middle_name, last_name);
    
END;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [92]:
%%sql


call create_student(
    "Duddley",
    "Frank",
    "Ferguson",
    NULL,
    @t);

select @t;

 * mysql+pymysql://root:***@localhost
0 rows affected.
1 rows affected.

[('dff3',)]

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('dff3',)]

In [94]:
%%sql

drop procedure if exists create_student;

CREATE PROCEDURE create_student(
    in first_name varchar(128),
    in middle_name varchar(128),
    in last_name varchar(128),
    in email varchar(256),
    out new_uni varchar(12)
)
BEGIN

    set new_uni = compute_student_uni(first_name, middle_name, last_name);
    
    insert into f22_db.students values(
        new_uni,
        first_name,
        middle_name,
        last_name,
        email
    );
    
    
    
END;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [96]:
%%sql

call create_student(
    "Duddley",
    "Frank",
    "Ferguson",
    NULL,
    @t);

select @t;

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.

[('dff3',)]

In [98]:
%sql select * from students;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[('dff1', 'Donald', 'Francis', 'Ferguson', 'dff@cs.columbia.edu'),
 ('dff2', 'Donald', 'Felix', 'Ferguson', None),
 ('dff3', 'Duddley', 'Frank', 'Ferguson', None),
 ('rf1', 'Robert', None, 'Ferguson', None),
 ('rf2', 'Roger', None, 'Ferguson', None),
 ('rf3', 'Ronald', None, 'Ferguson', None)]

# Trigger Example

- Relying on a user or program accessing the database to always call the procedure is risky.


- The user could just try to call the ```INSERT```.


- I can use security to disable general users from calling ```INSERT.```


- I can also use a trigger on the table to ALWAYS compute the uni.

In [101]:
%%sql

drop trigger if exists set_the_uni;

CREATE TRIGGER set_the_uni
    before INSERT
    ON students
FOR EACH ROW BEGIN

    declare new_uni varchar(12);
    
    set new_uni = compute_student_uni(
        new.first_name, 
        new.middle_name,
        new.last_name
    );
    
    set new.uni = new_uni;
        
END;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [103]:
%%sql

insert into f22_DB.students (last_name, first_name, middle_name, email)
values
    ("Ferguson", "Roland", NULL, NULL);

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [104]:
%sql select * from students;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[('dff1', 'Donald', 'Francis', 'Ferguson', 'dff@cs.columbia.edu'),
 ('dff2', 'Donald', 'Felix', 'Ferguson', None),
 ('dff3', 'Duddley', 'Frank', 'Ferguson', None),
 ('rf1', 'Robert', None, 'Ferguson', None),
 ('rf2', 'Roger', None, 'Ferguson', None),
 ('rf3', 'Ronald', None, 'Ferguson', None),
 ('rf4', 'Roland', None, 'Ferguson', None)]